In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("../sample.csv")

In [ ]:
df.head()

   Sno             Name   Age   salary     Designation        Mobile
0    1    shabeeh abaas  23.0  $20,000         manager  9.140098e+09
1    2  kashish agrawal  21.0  $23,000         manager  3.242343e+08
2    3     nisha shukla  22.0  $32,000  region manager  2.903482e+09
3    4     kriti rajput  22.0   $3,333             NaN           NaN
4    5     deepak gupta  23.0  $33,000         manager  2.343243e+08

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sno          8 non-null      int64
 1   Name         8 non-null      object
 2   Age          7 non-null      float64
 3   salary       7 non-null      object
 4   Designation  7 non-null      object
 5   Mobile       7 non-null      float64
dtypes: float64(2), int64(1), object(3)
memory usage: 512.0+ bytes

In [ ]:
df.isnull()

     Sno   Name    Age  salary  Designation  Mobile
0  False  False  False   False        False   False
1  False  False  False   False        False   False
2  False  False  False   False        False   False
3  False  False  False   False         True    True
4  False  False  False   False        False   False
5  False  False  False    True        False   False
6  False  False   True   False        False   False
7  False  False  False   False        False   False

In [ ]:
df.isnull().sum()

Sno            0
Name           0
Age            1
salary         1
Designation    1
Mobile         1
dtype: int64

In [ ]:
def salary_clean(salary):
    if isinstance(salary,str):
        salary=salary.strip()
        if "$" in salary:
            salary = salary.replace("$","")
        if "," in salary:
            salary= salary.replace(",","")
        return int(salary)
    return salary

In [ ]:
df["salary"].apply(salary_clean)

0    20000.0
1    23000.0
2    32000.0
3     3333.0
4    33000.0
5        NaN
6    23333.0
7     3333.0
Name: salary, dtype: float64

In [ ]:
df["salary"] = df["salary"].apply(salary_clean)

In [10]:
df

   Sno             Name   Age   salary     Designation        Mobile
0    1    shabeeh abaas  23.0  20000.0         manager  9.140098e+09
1    2  kashish agrawal  21.0  23000.0         manager  3.242343e+08
2    3     nisha shukla  22.0  32000.0  region manager  2.903482e+09
3    4     kriti rajput  22.0   3333.0             NaN           NaN
4    5     deepak gupta  23.0  33000.0         manager  2.343243e+08
5    6     mayank singh  23.0      NaN  region manager  2.334243e+08
6    7     aditya sagar   NaN  23333.0         manager  2.342423e+09
7    8         prashant  22.0   3333.0        director  2.324343e+07

In [11]:
#df.dropna()

In [12]:
df.drop(["Mobile","Sno","Name"],axis="columns")

    Age   salary     Designation
0  23.0  20000.0         manager
1  21.0  23000.0         manager
2  22.0  32000.0  region manager
3  22.0   3333.0             NaN
4  23.0  33000.0         manager
5  23.0      NaN  region manager
6   NaN  23333.0         manager
7  22.0   3333.0        director

In [13]:
df = df.drop(["Mobile","Sno","Name"],axis="columns")
#or
#df.drop(["Mobile","Sno","Name"],axis="columns",inplace=True)

In [14]:
df

    Age   salary     Designation
0  23.0  20000.0         manager
1  21.0  23000.0         manager
2  22.0  32000.0  region manager
3  22.0   3333.0             NaN
4  23.0  33000.0         manager
5  23.0      NaN  region manager
6   NaN  23333.0         manager
7  22.0   3333.0        director

In [15]:
from sklearn.impute import SimpleImputer

In [16]:
simple_imp = SimpleImputer()

In [17]:
cols = ["Age","salary"]

In [18]:
simple_imp.fit_transform(df[cols])

array([[2.30000000e+01, 2.00000000e+04],
       [2.10000000e+01, 2.30000000e+04],
       [2.20000000e+01, 3.20000000e+04],
       [2.20000000e+01, 3.33300000e+03],
       [2.30000000e+01, 3.30000000e+04],
       [2.30000000e+01, 1.97141429e+04],
       [2.22857143e+01, 2.33330000e+04],
       [2.20000000e+01, 3.33300000e+03]])

In [19]:
df[cols]=simple_imp.fit_transform(df[cols])

In [20]:
df

         Age        salary     Designation
0  23.000000  20000.000000         manager
1  21.000000  23000.000000         manager
2  22.000000  32000.000000  region manager
3  22.000000   3333.000000             NaN
4  23.000000  33000.000000         manager
5  23.000000  19714.142857  region manager
6  22.285714  23333.000000         manager
7  22.000000   3333.000000        director

In [21]:
df["Designation"].value_counts()

manager           4
region manager    2
director          1
Name: Designation, dtype: int64

In [22]:
simple_imp2 = SimpleImputer(strategy="most_frequent")

In [23]:
simple_imp2.fit_transform(df[["Designation"]])

array([['manager'],
       ['manager'],
       ['region manager'],
       ['manager'],
       ['manager'],
       ['region manager'],
       ['manager'],
       ['director']], dtype=object)

In [24]:
df["Designation"]=simple_imp2.fit_transform(df[["Designation"]])

In [25]:
df

         Age        salary     Designation
0  23.000000  20000.000000         manager
1  21.000000  23000.000000         manager
2  22.000000  32000.000000  region manager
3  22.000000   3333.000000         manager
4  23.000000  33000.000000         manager
5  23.000000  19714.142857  region manager
6  22.285714  23333.000000         manager
7  22.000000   3333.000000        director

In [26]:
df[["Designation"]].ndim

2

In [27]:
gender = ["male","female"]

In [1]:
from sklearn.preprocessing import OneHotEncoder
desig_enc = OneHotEncoder(drop='first')
desig_enc.fit(df[['Designation']])

NameError: name 'df' is not defined